 
                                  insert code
§1                      START F1:
HAPPY HOUR §1:§2          END F1:
HAPPY HOUR §1:§2            START F2:
HAPPY HOUR §1:§2          END F2:
HAPPY HOUR §1:§2            START F3:
HAPPY HOUR §1:§2          END F3:
HAPPY HOUR §1:§2            coin        §1  §2
card      0=acc. coin        §1  §2
no card   0=acc. max. credit card
§1                 1=PROGRAMMING
2=DATA 3=TESTV.       4=RINSE - CLEAN
5=MAINT. 6=MODEM    1=PROGR  2=DATA
3=TEST   4=CLEAN    1=PROGR  2=DATA
3=TEST   4=CLEAN    discount
card     -  §1 %           Def. Vibr. mot.
Time gr.  §1  §2    FUNCTIONING
                        not used
                           PRODUCT  §1
0=inhib.    §2.§3       DOSAGE grams
PRODUCT §1  §2.§3      start delay
PRODUCT  §1 §2.§3       breaks number
0-2 15=max   §1       WATER §1 time
0=inhib.    §2.§3     start delay
WATER §1    §2.§3       MIXER §1
0=inhib.    §2.§3          start delay
MIXER §1    §2.§3       water flow  : §1
§2                 selection name§1§2
§3               delay station
§1.§2                 Programming:
§1                     MIXER speed   §1
§2                 day of week
§1.                     SWITCHING ON:
§1.     §2:§3         SWITCHING OFF:
§1.     §2:§3        RINSING:
§1:§2                      HOUR:
§1:§2                         DAY:
§1                             MONTH:
§1                           YEAR :
§1                           COFFEE WATER
0=inhib.  cc:§1        COFFEE SEQUENCE
1=cof. before  §1   Kilowatt hours
§1.§2                X4 rinse 2 wat.
in brewer  §1ml     first installat.
0=first       §1   not used
                           Fresh Milk
§1                       VOLTAGE
volt:       §1.§2           TEST MODEM
SEL 4                    not used
                           PRESELECTION
                       INHIBITED
----------------          X5 wait time 2
wat. brew. §1.§2s    Def. Vibr. mot.
Speed gr. §1  §2    ENABLE DISPLAY
TEMPERA. 1=YES §1    X6 wait time 3
empty wat. §1.§2s    TOTAL SELECTIONS
§1                 PART. SELECTIONS
§1                 TOTAL  MONEY
§1                     PARTIAL MONEY
§1                    TOTAL TESTS
§1                      PARTIAL TESTS
§1                    total loaded on
card§1  §2          part. loaded on
card§1  §2          total unloaded
card§1  §2           part. unloaded
card§1  §2           total loaded on
card   §1           part. loaded on
card   §1           total unloaded
card   §1            part. unloaded
card   §1            not used
                           not used
                           not used
                           not used
                           not used
                           not used
                           not used
                           not used
                           PART. §1 SEL.  §2
§3                PART.  SEL.  §1
§2                  PART.  SEL.  §1
HAPPY  §2           PART.  SEL.  §1
FRE.JUG§2           COIN   §1
§2                        PRICE  §1
§2                        TEMPERATURE
Temp. EV1   §1          DEFINITION
first coffee §1          TEMPERATURE
Temp. EV2   §1          PL for cash
0=PL1 1=PL2    §1       select grinder 2
1=yes          §1  not used
                           preselection
BARLEY                 REGISTRATION----
-OUT OF SERVICE    Selection repeat
§1                 heating time
sec.: §1.§2            TEMPERATURE
Temp. EV3   §1          PROGRAMMING-----
-BUTTON §1------   PROGRAMMING-----
-CLOCK----------   PROGRAMMING-----
PRICES       §1    PROGRAMMING-----
-PRICES---------   PROGRAMMING-----
-COINS----------   PROGRAMMING-----
-TEMPERATURE----   PROGRAMMING-----
-MISCELLANEOUS--   DIAGNOSTICS-----
----------------   SALES AUDIT-----
----------------   PROGRAMMING-----
HAPPY PRICE=§1     PROGRAMMING-----
-HAPPY PRICE       PROGRAMMING-----
PRODUCT QTY        PROGRAMMING-----
-MAINTENANCE----   PROGRAMMING-----
RFID CARD          TEST MOV. SUGAR
sel 4               Tea Bag
0=inhibit     §1            numero cicli
§1                     pausa ciclico
sec:       §1         selez. ciclico
0=fissa        §1    machine code
A        §1            machine code
B        §1            message number
§1                   coin-mech type
§1                   prog menu
access code  §1           not used
                           stirrer 0=before
1=after       §1   fan time
min.        §1             Beep time
§1.§2                     decimal number
§1                   PL for cashless
0=PL1 1=PL2    §1   language:
english                   SEL STOP
no=0 yes=1  §1             not used
                           TEMPERATURE
Delta        §1         not used
                           not used
                           tuning pump   §1
§2 §3 %            tuning motor  §1
§2 §3 %            coffee time
grinder     §1.§2       coffee grams
grinder     §1.§2      tuning grinder
§1 §2 %              Preselection
NO SUGAR               TEST MOV. SUGAR
sel 4               Preselection
NO SUGAR               extra milk
quantity    +§1.§2       Latte-Macchiato
START BREWER§1.§2   not used
                           Limiting current
10A                Not Used
                           TEMPERATURE
heater:      §1         not used
                           coffee grains
[§1.§2]  §3.§4        water quantity
ESPRESSO   -§1 %     canister
Cafe 2    n:   §1          Cafe 2  price
0=+ 1=-       §1      ev-mixer
CAFE 2    n:   §1          Enable preselect
button  §1:§2      canister
SUGAR        n:§1          X7 rinsing
temperat.  §1            Preselection
ESPRESSO               stirrer
§1                          Preselection
EXTRA SUGAR            PRODUCT
MILK  LM     n:§1           Enable  counter
0=no  1=yes   §1    extra sugar
quantity    +§1.§2      canister
BARLEY       n:§1          ev-mixer
BARLEY       n:§1          BARLEY price
0=+ 1=-       §1       n.§1 off §2 §3
§4:§5 §6-§7-20§8     n.§1  NO
OUT OF SERVICE             stirrer
§1                          cup sensor
1=Enable       §1        Vibr.mot.
Time gr.     §1           Vibr. mot.
Speed gr.    §1          PWM Pump
§1%                        FREE VEND enable
0=no 1=1 2=++  §1  not used
                           dec. cof.grounds
[§1]    §2         FREE VEND enable
0=no 1=1 2=++  §1  not used
                           not used
                           product qty   §1
[§2.§3]  §4.§5     Preselection
JUG                    EV Fresh-milk
§1.§2                 not used
                           prod. §1 warning
thresold: §2.§3    abil stop prod §1
1=stop         §2 TOTAL  FREE
§1                      PART.    FREE
§1                    TOTAL  CASH
CASH   §1               PART.  CASH
CASH   §1               N.TOT. SEL. CASH
§1                 N.PART.SEL. CASH
§1                 TOTAL  CASH-BOX
§1                  PART.  CASH-BOX
§1                  TOTAL SEL. CARD§1
§2                PART. SEL. CARD§1
§2                TOTAL  SEL. CARD
§1                 PART.  SEL. CARD
§1                 Ejection tubes
b. :4-5-7-8-9-10     escrow enable
0=enab. 1=dis. §1     credit max
§1                       rest  max
§1                        Sell type
0=sing. 1=mult.§1         Token value
§1                      coin rest   §1  §2
0=acc. 1=disab.  coin no rest §1 §2
0=acc. 1=disab.  MDB tubes value
§1                  Bill validator
enab=  0;1;2  =§1    PROGRAMMING-----
- MDB ----------   Preselection
EXTRA MILK             Preselection
ESPRESSO               Preselection
SELECTIONS 25-36       Preselection
DECAFFEINATED          Preselection
not used               Preselection
NO CUP                 Preselection
BARLEY                 TEST GROUP
Absorption  sel4         boiler  cc:
0=400   1=800  §1       not used
                           quick menu
access code  §1          EV air
Fresh-milk  §1.§2            not used
                           TUNING
MOTORS                       Calibrate Coffee
Push PROG   §1     LM Milk water
Number=        §1     not used
                           uninstallation
10=START             TEMPERATURE
Espresso    §1          not used
                           TEMPERATURE
boiler      §1          X8 Clousure
brewer      §1%         TEMPERATURE
Latte Mac.  §1          code   ID 101
§1                    code   ID 104
§1                    code   ID 106
§1                    address VIDTS
§1                    Protocol
§1                         DataAudit 0=TMON
1=DDCMP 2=DIAG §1  not  used
                          PROGRAMMING-----
-ID. MACHINE       Summer Time
1=yes          §1       not used
                           LOW PRESSURE
                       X9 wait time 3
last cof. §1 min     X10 min cof. qty
to engage §1 cc    A1 PWM Variflex
move        §1%     A2 Pump On time
§1.§2[s]            Preselection
SELECTIONS 37-48       Preselection
BIG CUP                Coffee Sensor
1=Enable      §1      not used
                           WATER
percent    +§1 %              + or   -  PRICE
0=+  1=-      §1    PRODUCT
percent    +§1 %            not used
                           not used
                           not used
                           not used
                           not used
                           PREINFUSION
0=no   sec.:§1          JUG
0=no        n:§1                preselection
SUGAR                  preselection
LONG                   water
LONG       +§1 %              number of selec.
Bingo       §1     price with card
1=price happy  §1   push <PROG> to
load:   §1           Default sugar
LED:0-5       =§1     not used
                           A3 Pump OFF time
§1.§2[s]           A5 pressure
number        §1        PROGRAMMING-----
-MDB USD--------   PROGR. MDB USD §1
SEL. 4            PROGR. MDB USD
SEL. 4               Calibr. motor §1
gr/sec    §2       product §1 used
part.g.§2           product §1 used
Tot. g.§2           CALIBRATION-----
PRODUCT FLUX       PRODUCT AUDIT---
------FLUX-----    TEST MOTOR
Absorption  sel4         tun. grinder  §1
§2 §3 %            not used
                           activ.H2o filter
Reset  0=no    §1  not used
                           A6 water after
coffee   §1[ml]      A7 chamber
aperture    §1%          DA rotation
0=auto 1=man.  §1       Set preheating
selection §1         MDB offset own
cup 0=no 1=yes §1    granulometry
§1                     not used
                           pricehold query
no=0 yes=1     §1   Side water pump
0-4           §1    Brewer pressure
0=max 10=min. §1    Double coffee
0=no 1=yes     §1     driptray
identif. yes=1-§1          not used
                           Preselection
name:   §1             not used
                           Cup size
§1                         vend payment
timeout §1 sec.        ev fresh milk
delay       §1.§2     ev air fresh
milk delay  §1.§2      not  used
                          not  used
                          PROGRAMMING ----
VARIGRIND §1       A7 chamber
aperture    §1%          PROGRAMMING ----
- MILKER    ----   dispensing cup
0=yes 1=no     §1    not  used
                          not  used
                          PROGRAMMING ----
VARIGRIND 2        PRESEL. NUM §1§2
§3                 Verified data
§1                    Water Flush mode
1=ON 0=OFF §1       
                                  xxxxxx
                             PROGRAMMING ----
RFID BLACK LIST    block card §1
number      §2        TEST CUP STATION
sel 4              not used
                           PROGRAMMING ----
VARIFLEX           PROGRAMMING ----
MICRO              PROGRAMMING ----
                   TEMPERATURE
Temp. EV4   §1          Preselection
SELECTIONS 49-60       xxxxxx
                             xxxxxx
                             not used
                           Time cleaning
MILK Mod.  §1:§2      F.Milk  Topping-
switch  yes=1- §1  Calibrate Cof  2
Push PROG   §1     cup sens.thresh.
0=dis  §1 - §2     Set Free Vend
Ins hours   §1        Enable dataaudit
before  1=yes  §1  Instant Scaling
Factor   §1 §2 %    TEST STIRRER
sel 4                  Security Level
level 1-4      §1    Calibrate Cof  3
Push PROG   §1     Calibrate Cof  4
Push PROG   §1     coffee repeat
0=disabled     §1     Current language
§1                 SWITCHING ON:
§1.     §2:§3         X4 rinse 2 wat.
in brewer  §1ml     VOLTAGE
volt:       §1.§2           REGISTRATION----
-OUT OF SERVICE    stirrer 0=before
1=after       §1   decimal number
§1                   cup sensor
1=Enable       §1        ev-mixer
CAFE 2    n:   §1          not used
                           breaks number
0-2 12=max   §1       Power adj. pump
0=no 1=yes  §1      